<?php 
  session_start();
?>
<html>
  <head>
    <title>Phuangngern Rental</title>
    <meta charset="UTF-8">
    <meta name="viewport"content="width=device-width, initial-scale=1"> 

    <!--CSS-->
    <link rel="stylesheet" href="css/roomnhouse.css">

    <!-- font -->    
    <link rel="stylesheet" href="https://fonts.googleapis.com/css?family=Lato">

    <!--Icon-->
    <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/4.7.0/css/font-awesome.min.css">

    <!--Icon Top-->
    <link rel="icon" href="favicon.png">
  </head>

    <body>

        <div class="header">
          <!--<h1>Welcome To Phuangngern Rental</h1>-->
            <div style="width:100%;height:400px;">  
              <img src="BG1.jpg" alt="BG1" style="float:left;width:50%;height:100%;object-fit:cover;">
              <img src="BG2.jpg" alt="BG2" style="float:left;width:50%;height:100%;object-fit:cover;">
            </div>
        </div>
    
        <div class="navbar">
          <div class="topnav" id="myTopnav">
            <a href="index.php" class="active">Phuangngern Rental</a>
            <a href="roomnhouse.php">Room & House</a>
            <a href="statment.php">Info</a>
            <?php if(isset($_SESSION['username'])):?>
            <a href="index.php?logout=1" class="right">Logout</a>
            <?php else:?>
            <a href="login.php" class="right">Login</a>
            <?php endif?>
            <a href="javascript:void(0);" class="icon" onclick="myFunction()">
              <i class="fa fa-bars"></i>
            </a>
          </div>
        </div>
        <div class="header" >
          <h1>Contract</h1>
          <h2>Pls read before goto info</h2>
        </div>
        <div style="background-color:#D2B48C;color:black;padding:50px;">
          <h2>กฎการเช่า</h2>
            <d1>
              <dt>1.ผู้เช่าตกลงเช่าบ้านเช่าของเครือPhuangngern เพื่อเป็นประโชยน์ในการอาศัย ในอัตราเช่าได้แก่(1400/1500/2500/2700/3500)ต่อเดือน  โดยมีกำหนดการเช่า 2 เดือน มีค่าใช้จ่ายประกันแรกเข้า 600 บาท เมื่อผู้เช่าได้เช่าบ้านจนครบกำหนดเวลา หากผู้เช่ามิได้แจ้งยกเลิกการเช่าให้ถือว่าสัญญาฉบับนี้มีผลบังคับใช้ต่อไปทุกระยะเวลาการเช่า หากผู้เช่าประสงค์จะยกเลิกการเช่าต้องแจ้งให้ทราบล่วงหน้า 30วัน</dt>
              <dt>2.ผู้เช่าตกลงชำระค่าเช่าให้แก่ผู้ให้เช่าเป็นการล่วงหน้าภายในวันที่ 5 ของทุกเดือน ถ้าหากชำระเกินวันดังกล่าวผู้เช่ายินยอมเสียค่าปรับในอัตราวันละ 100 บาท</dt>
              <dt>3.ผู้เช่าต้องดูแลรักษาความสะอาดบริเวณบ้านของผู้เช่าเอง </dt>
              <dt>4.ผู้เช่าต้องรับผิดชอบในความเสียหาย การสูญหายและการบุบสลายใดๆ อันเกิดแก่บ้านอาศัยและทรัพย์สินต่างๆ ในบ้านพักดังกล่าวและผู้เช่าต้องยินยอมให้ผู้ให้เช่าหรือตัวแทนของผู้ให้เช่าเข้าตรวจสอบดูบ้านเช่าได้เป็นครั้งคราว </dt>
              <dt>5.หากมีทรัพย์สินเสียหายโดยเกิดจากอายุไขหรือความเสียหายตามการเวลา ผู้เช่าสามารถเบิกได้จากร้านค่าในเครือ แต่ถ้าหากความเสียหายเกิดขึ้นจากผู้เช่า ทางผู้เช่าต้องป็นคนรับผิดชอบด้วยตนเอง</dt>
              <dt>6.ผู้เช่าต้องแจ้งชื่อที่อยู่ให้แก่ผู้ให้เช่าทราบก่อนที่ผู้เช่าจะนำบริวารเข้าพัก</dt>
              <dt>7.ผู้เช่าสัญญาว่าจะพักอยู่ในห้องด้วยความสงบ ไม่กระทำหรือยินยอมให้ผู้อื่นกระทำการใดๆ ภายในหรือภายนอกบ้านเช่า อันเป็นการขัดต่อกฎหมายหรือศีลธรรมอันดี หรือก่อให้เกิดความเดือดร้อนรำคาญแก่ผู้พักรายอื่น</dt>
              <dt>8.ผู้เช่าสัญญาว่าจะไม่นำสัตว์เลี้ยง วัตถุไวไฟ อาวุธ วัตถุระเบิด สิ่งเสพติด ของมึนเมา สุรา และสิ่งผิดกฎหมายเข้ามาในบริเวณบ้านเช่า หากเกิดความเสียหายผู้ให้เช่าจะไม่รับผิดชอบใดๆ</dt>
              <dt>9.ผู้เช่าสัญญาว่าจะไม่ทิ้งสิ่งที่จะทำให้เกิดการอุดตัน ลงในท่อน้ำทิ้งหรือชักโครก หากเกิดการอุดตันผู้เช้าจะต้องรับผิดชอบค่าใช้จ่ายดังกล่าวเอง</dt>
              <dt>10.ผู้เช่าจไม่ทำการดัดแปลงทรัพย์สินต่างๆ ในบ้านเช่า หรือเคลื่อนย้ายทรัพย?สินต่างๆออกนอกตัวบ้าน และไม่ทำการตอก เจาะ หรือขันน็อตที่ผนัง แพดานบ้านพักหรือทรัพย์สินใดๆ ในบ้านพัก หากฝ่าฝืนผู้เช่ายินยอมจ่ายค่าเสียหายแก่ผู้ให้เช่า</dt>
              <dt>11.ผู้เช่าสัญญาว่าจะปฎิบัติตามระเบียบ ข้อบังคับ และประกาศของผู้ให้เช่า ซึ่งได้แจ้งให้ทราบโดยการติดประกาศไว้ในจุดต่างๆ </dt>
              <dt>12.ผู้ให้เช่าจะไม่รับผิดชอบในความสูญหายหรือความเสียหายใดๆ อันเกิดขึ้นแก่ทรัพย์สินภายในบ้านพัก ยานพาหนะ รวมทั้งทรัพย์สินต่างๆ ในยานพาหนะของผู้เช่าซึ่งนำมาจอดบริเวณพื่นที่ของเครือ</dt>
              <dt>13.ในกรณียอดคค้างชำระเกิน 1 เดือน ผู้เช่าจะยินยอมให้ผู้ให้เช่าครอบครองบ้านพักได้ทันทีและให้ถือว่าสัญญาการเช่ายุติ ผู้ให้เช่าสามารถไขกุญแจเข้าห้องได้โดยพลการ หากมีทรัพย์สินของผู้เช่าอยู่ ผู้ให้เช่าจะเก็บรักษาไว้ให้ (ผู้เช่านำออกภายใน7วัน) และหากจำเป็นก็ยินยอมให้นำออกขายเพื่อชำระค่าเช่าที่ค้างชำระ หรือหากของที่เก็บไว้ทำให้ผู้อื่นเดือดร้อน ผู้เช่าจะยินยอมให้ทำลายทิ้ง</dt>
              <dt>14.ถ้าผู้เช่ายกเลิกสัญญาก่อนครบกำหนดตามสัญญา หรือผู้เช่าไม่ปฏิบัติตามสัญญานี้ด้วยเหตุใดๆ ผู้ให้เช่ามีสิทธิ์เชิญผู้เช่าออกจากห้องพัก โดยต้องจ่ายค่าสาธารณูประโภคทั้งหมดก่อนการขนย้ายทรัพย์สินของผู้เช่าและบริวารออกไป</dt>
              <dt>15.ในกรณีเช่าบ้านรายวัน ผู้เช่าต้องปฏิบัติตามดังนี้</dt>
                <dd>• กรอกสัญญาเช่ารายวัน โดยมายื้นสัญญาที่กรอกแก่ผู้เช่ากับผู้ให้เช่า</dd>
                <dd>•	ชำระเงินรายวันคืนละ 300 บาท (โดยไม่เสียค่าสาธารณูปรธโภคใดๆ)</dd>
                <dd>•	เมื่อครบกำหนดเช่า ให้นำทรัพย์สินของผู้เช่าออก หากมีการลืมทรัพย์สินสำคัญทางผู้ให้เช่าจะเก็บรักษาไว้ให้(ผู้เช่าต้องมารับภายใน7วัน) หากไม่มารับทางผู้ให้เช่าจะขอริบทรัพย์สินนั้นๆไป</dd>
              <dt>16.ในกรณีมีการย้ายออก ผู้เช่าต้องปฏิบัติดังนี้</dt>
                <dd>•	ส่งมอบกุญแจคืนแก่ผู้ให้เช่า ชำระค่าสาธารณูประโภคต่างๆ คืนบ้านเช่าในลักษณะที่สะอาด เรียบร้อย เช่นเดียวกับเมื่อผู้เช่าเริ่มเข้าพัก </dd>
                <dd>•	ขนทรัพย์สินของผู้เช่าออกจากบ้านพัก โดยต้องให้แล้วเสร็จ (สามารถขนย้ายได้ตั้งแต่เวลา 8.00-16.00น .) ภายในวันที่มีการขนย้าย</dd>
            </d1>
            
        </div>

        <!--into info-->
        <?php if (isset($_SESSION['username'])):?>
        <div class="header">
          <input type="checkbox" name="chekbox" onchange="onbutton(this)">
            <label for="vehicle">ยอมรับเงื่อนไขการเช่า</label><br>
          <button class="btn" onclick="window.location.href='info.php'" id="lastbtn" disabled>ทำสัญญา</button>
        </div>
        <?php endif?>

        <script>
            function myFunction() {
                var x = document.getElementById("myTopnav");
                if (x.className === "topnav") {
                    x.className += " responsive";
                } else {
                    x.className = "topnav";
                }
            }
            function onbutton(x){
              
              if(x.checked){
                document.getElementById("lastbtn").removeAttribute("disabled");
              }
              else{
                document.getElementById("lastbtn").setAttribute("disabled", "disabled");
              }
            }
        </script>
    </body>
</html>